zup/ЗУП_бюджет/src/Enums/ТипыПоказателейРасчетаЗарплаты/ТипыПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>Денежный</name>
  </enumValues>
  <enumValues>
    <name>Числовой</name>
  </enumValues>
  <enumValues>
    <name>ЧисловойЗависящийОтДругогоПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ЧисловойЗависящийОтСтажа</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты/СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыПримененияЗначенийПоказателейРасчетаЗарплаты</name>
  <enumValues>
    <name>Постоянное</name>
  </enumValues>
  <enumValues>
    <name>Разовое</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/Enums/ПоказателиТарификацииМедРаботников/ПоказателиТарификацииМедРаботников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПоказателиТарификацииМедРаботников</name>
  <enumValues>
    <name>ПроцентНадбавкиЗаВыслугуЛет</name>
  </enumValues>
  <enumValues>
    <name>ПроцентНадбавкиЗаУсловияТруда</name>
  </enumValues>
  <enumValues>
    <name>ПроцентНадбавкиЗаКатегорию</name>
  </enumValues>
  <enumValues>
    <name>ПроцентНадбавкиЗаУченуюСтепень</name>
  </enumValues>
  <enumValues>
    <name>ПроцентНадбавкиЗаПочетноеЗвание</name>
  </enumValues>
  <enumValues>
    <name>ПовышениеЗаЕзду</name>
  </enumValues>
  <enumValues>
    <name>ПроцентСниженияОклада</name>
  </enumValues>
</mdclass:Enum>

zup/ЗУП_бюджет/src/CommonModules/ТарификационнаяОтчетностьУчрежденийФМБАКлиентСервер/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Тарификационная отчетность в медицине".
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьЗначенияРеквизитовПоказателяТарификации(Форма) Экспорт
	
	Если Не Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьТарификационнуюОтчетностьУчрежденийФМБА") Тогда
		Возврат;
	КонецЕсли;

	Объект = Форма.Объект;
	
	ЧисловойЗависящийОтСтажа = Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейРасчетаЗарплаты.ЧисловойЗависящийОтСтажа");
	
	ПостоянныйЧисловой = (Объект.ТипПоказателя = ПредопределенноеЗначение("Перечисление.ТипыПоказателейРасчетаЗарплаты.Числовой")
		И Объект.СпособПримененияЗначений = ПредопределенноеЗначение("Перечисление.СпособыПримененияЗначенийПоказателейРасчетаЗарплаты.Постоянное"));
		
	Если Не ЧисловойЗависящийОтСтажа И Не ПостоянныйЧисловой Тогда 
		Форма.ЯвляетсяПоказателемТарификации = Ложь;
	КонецЕсли;
	
	Если Форма.ЯвляетсяПоказателемТарификации И ЧисловойЗависящийОтСтажа Тогда
		Форма.ВидПоказателяТарификации = ПредопределенноеЗначение("Перечисление.ПоказателиТарификацииМедРаботников.ПроцентНадбавкиЗаВыслугуЛет");
	ИначеЕсли Не (ЧисловойЗависящийОтСтажа ИЛИ ПостоянныйЧисловой) Или Не Форма.ЯвляетсяПоказателемТарификации Тогда 
		Форма.ВидПоказателяТарификации = Неопределено;
	КонецЕсли;
		
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидПоказателяТарификацииГруппа", "Доступность", (ЧисловойЗависящийОтСтажа ИЛИ ПостоянныйЧисловой));
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидПоказателяТарификации", "Доступность", Форма.ЯвляетсяПоказателемТарификации);
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидПоказателяТарификации", "АвтоОтметкаНезаполненного", Форма.ЯвляетсяПоказателемТарификации); 
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Форма.Элементы, "ВидПоказателяТарификации", "ОтметкаНезаполненного",     Форма.ЯвляетсяПоказателемТарификации И Не ЗначениеЗаполнено(Форма.ВидПоказателяТарификации));

КонецПроцедуры

#КонецОбласти
